app/controllers/characters_controller.rb

INSERT INTO "characters" ("created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-10 16:21:06.583361"], ["description", "Desc"], ["name", "Test"], ["updated_at", "2014-06-10 16:21:06.583361"], ["user_id", 1]]
---
    def create
        @character = current_user.characters.new(character_params)

        respond_to do |format|
            if @character.save

DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]
---
    def destroy
        @character.destroy