app/controllers/places_controller.rb

INSERT INTO "places" ("created_at", "description", "name", "region_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-06-11 18:20:53.382725"], ["description", "Yoo"], ["name", "What's up?"], ["region_id", 1], ["updated_at", "2014-06-11 18:20:53.382725"], ["user_id", 1]]
---
    def create
        @place = @region.places.new(place_params)
        @place.user = current_user
        respond_to do |format|
            if @place.save

DELETE FROM "places" WHERE "places"."id" = ?  [["id", 4]]
---
    def destroy
        @place.destroy

SELECT  "regions".* FROM "regions"  WHERE "regions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_region
        @region = Region.find(params[:region_id])