app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
  def index
    @regions = Region.all

INSERT INTO "regions" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-05 05:17:06.673848"], ["description", "This is a desc"], ["name", "General Discussion"], ["updated_at", "2014-06-05 05:17:06.673848"]]
---
  def create
    @region = Region.new(region_params)

    respond_to do |format|
      if @region.save

DELETE FROM "regions" WHERE "regions"."id" = ?  [["id", 2]]
---
  def destroy
    @region.destroy

SELECT  "regions".* FROM "regions"  WHERE "regions"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_region
    @region = Region.find(params[:id])