app/controllers/replies_controller.rb

SELECT "replies".* FROM "replies"
---
  def index
    @replies = Reply.all

INSERT INTO "replies" ("body", "character_id", "created_at", "place_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "Hello"], ["character_id", 5], ["created_at", "2014-06-11 20:49:41.872054"], ["place_id", 10], ["updated_at", "2014-06-11 20:49:41.872054"], ["user_id", 1]]
---
  def create
    @reply = @place.replies.new(reply_params)
    @reply.user = current_user
    respond_to do |format|
      if @reply.save

UPDATE "replies" SET "character_id" = ?, "updated_at" = ? WHERE "replies"."id" = 4  [["character_id", nil], ["updated_at", "2014-06-11 20:51:06.575537"]]
---
  def update
    respond_to do |format|
      if @reply.update(reply_params)

SELECT  "replies".* FROM "replies"  WHERE "replies"."id" = ? LIMIT 1  [["id", 56]]
---
  def set_reply
    @reply = Reply.find(params[:id])