app/controllers/users_controller.rb

  def create
    if @user.save
---
INSERT INTO "users" ("created_at", "displayname", "email", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-11 12:21:19.734380"], ["displayname", "Neikos"], ["email", "123"], ["updated_at", "2014-06-11 12:21:19.734380"]]

  def login
    puts login_params.inspect
    if @user = User.find_by_email(login_params[:email]).authenticate(login_params[:password]) then
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = '123@sds.com' LIMIT 1