app/views/regions/show.html.erb

  <tbody>
    <% @region.places.each do |place| %>
---
SELECT "places".* FROM "places"  WHERE "places"."region_id" = ?  [["region_id", 1]]